MikroElektronika/core_packages/PIC/XC8/def/PIC18LF67K40/mcu.h
extern volatile CWG1PPSbits_t CWG1PPSbits __at(0xE0B);
// bitfield macros
#define _CWG1PPS_PIN_POSN                                   0x0
#define _CWG1PPS_PIN_POSITION                               0x0
#define _CWG1PPS_PIN_SIZE                                   0x3
#define _CWG1PPS_PIN_LENGTH                                 0x3
#define _CWG1PPS_PIN_MASK                                   0x7
#define _CWG1PPS_PORT_POSN                                  0x3
#define _CWG1PPS_PORT_POSITION                              0x3
#define _CWG1PPS_PORT_SIZE                                  0x2
#define _CWG1PPS_PORT_LENGTH                                0x2
#define _CWG1PPS_PORT_MASK                                  0x18
#define _CWG1PPS_CWGINPPS_POSN                              0x0
#define _CWG1PPS_CWGINPPS_POSITION                          0x0
#define _CWG1PPS_CWGINPPS_SIZE                              0x6
#define _CWG1PPS_CWGINPPS_LENGTH                            0x6
#define _CWG1PPS_CWGINPPS_MASK                              0x3F
#define _CWG1PPS_CWGINPPS0_POSN                             0x0
#define _CWG1PPS_CWGINPPS0_POSITION                         0x0
#define _CWG1PPS_CWGINPPS0_SIZE                             0x1
#define _CWG1PPS_CWGINPPS0_LENGTH                           0x1
#define _CWG1PPS_CWGINPPS0_MASK                             0x1
#define _CWG1PPS_CWGINPPS1_POSN                             0x1
#define _CWG1PPS_CWGINPPS1_POSITION                         0x1
#define _CWG1PPS_CWGINPPS1_SIZE                             0x1
#define _CWG1PPS_CWGINPPS1_LENGTH                           0x1
#define _CWG1PPS_CWGINPPS1_MASK                             0x2
#define _CWG1PPS_CWGINPPS2_POSN                             0x2
#define _CWG1PPS_CWGINPPS2_POSITION                         0x2
#define _CWG1PPS_CWGINPPS2_SIZE                             0x1
#define _CWG1PPS_CWGINPPS2_LENGTH                           0x1
#define _CWG1PPS_CWGINPPS2_MASK                             0x4
#define _CWG1PPS_CWGINPPS3_POSN                             0x3
#define _CWG1PPS_CWGINPPS3_POSITION                         0x3
#define _CWG1PPS_CWGINPPS3_SIZE                             0x1
#define _CWG1PPS_CWGINPPS3_LENGTH                           0x1
#define _CWG1PPS_CWGINPPS3_MASK                             0x8
#define _CWG1PPS_CWGINPPS4_POSN                             0x4
#define _CWG1PPS_CWGINPPS4_POSITION                         0x4
#define _CWG1PPS_CWGINPPS4_SIZE                             0x1
#define _CWG1PPS_CWGINPPS4_LENGTH                           0x1
#define _CWG1PPS_CWGINPPS4_MASK                             0x10
#define _CWG1PPS_CWG1INPPS_POSN                             0x0
#define _CWG1PPS_CWG1INPPS_POSITION                         0x0
#define _CWG1PPS_CWG1INPPS_SIZE                             0x6
#define _CWG1PPS_CWG1INPPS_LENGTH                           0x6
#define _CWG1PPS_CWG1INPPS_MASK                             0x3F
#define _CWG1PPS_CWG1INPPS0_POSN                            0x0
#define _CWG1PPS_CWG1INPPS0_POSITION                        0x0
#define _CWG1PPS_CWG1INPPS0_SIZE                            0x1
#define _CWG1PPS_CWG1INPPS0_LENGTH                          0x1
#define _CWG1PPS_CWG1INPPS0_MASK                            0x1
#define _CWG1PPS_CWG1INPPS1_POSN                            0x1
#define _CWG1PPS_CWG1INPPS1_POSITION                        0x1
#define _CWG1PPS_CWG1INPPS1_SIZE                            0x1
#define _CWG1PPS_CWG1INPPS1_LENGTH                          0x1
#define _CWG1PPS_CWG1INPPS1_MASK                            0x2
#define _CWG1PPS_CWG1INPPS2_POSN                            0x2
#define _CWG1PPS_CWG1INPPS2_POSITION                        0x2
#define _CWG1PPS_CWG1INPPS2_SIZE                            0x1
#define _CWG1PPS_CWG1INPPS2_LENGTH                          0x1
#define _CWG1PPS_CWG1INPPS2_MASK                            0x4
#define _CWG1PPS_CWG1INPPS3_POSN                            0x3
#define _CWG1PPS_CWG1INPPS3_POSITION                        0x3
#define _CWG1PPS_CWG1INPPS3_SIZE                            0x1
#define _CWG1PPS_CWG1INPPS3_LENGTH                          0x1
#define _CWG1PPS_CWG1INPPS3_MASK                            0x8
#define _CWG1PPS_CWG1INPPS4_POSN                            0x4
#define _CWG1PPS_CWG1INPPS4_POSITION                        0x4
#define _CWG1PPS_CWG1INPPS4_SIZE                            0x1
#define _CWG1PPS_CWG1INPPS4_LENGTH                          0x1
#define _CWG1PPS_CWG1INPPS4_MASK                            0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned CWGINPPS               :6;
    };
    struct {
        unsigned CWGINPPS0              :1;
        unsigned CWGINPPS1              :1;
        unsigned CWGINPPS2              :1;
        unsigned CWGINPPS3              :1;
        unsigned CWGINPPS4              :1;
    };
    struct {
        unsigned CWG1INPPS              :6;
    };
    struct {
        unsigned CWG1INPPS0             :1;
        unsigned CWG1INPPS1             :1;
        unsigned CWG1INPPS2             :1;
        unsigned CWG1INPPS3             :1;
        unsigned CWG1INPPS4             :1;
    };
} CWGINPPSbits_t;
extern volatile CWGINPPSbits_t CWGINPPSbits __at(0xE0B);
// bitfield macros
#define _CWGINPPS_PIN_POSN                                  0x0
#define _CWGINPPS_PIN_POSITION                              0x0
#define _CWGINPPS_PIN_SIZE                                  0x3
#define _CWGINPPS_PIN_LENGTH                                0x3
#define _CWGINPPS_PIN_MASK                                  0x7
#define _CWGINPPS_PORT_POSN                                 0x3
#define _CWGINPPS_PORT_POSITION                             0x3
#define _CWGINPPS_PORT_SIZE                                 0x2
#define _CWGINPPS_PORT_LENGTH                               0x2
#define _CWGINPPS_PORT_MASK                                 0x18
#define _CWGINPPS_CWGINPPS_POSN                             0x0
#define _CWGINPPS_CWGINPPS_POSITION                         0x0
#define _CWGINPPS_CWGINPPS_SIZE                             0x6
#define _CWGINPPS_CWGINPPS_LENGTH                           0x6
#define _CWGINPPS_CWGINPPS_MASK                             0x3F
#define _CWGINPPS_CWGINPPS0_POSN                            0x0
#define _CWGINPPS_CWGINPPS0_POSITION                        0x0
#define _CWGINPPS_CWGINPPS0_SIZE                            0x1
#define _CWGINPPS_CWGINPPS0_LENGTH                          0x1
#define _CWGINPPS_CWGINPPS0_MASK                            0x1
#define _CWGINPPS_CWGINPPS1_POSN                            0x1
#define _CWGINPPS_CWGINPPS1_POSITION                        0x1
#define _CWGINPPS_CWGINPPS1_SIZE                            0x1
#define _CWGINPPS_CWGINPPS1_LENGTH                          0x1
#define _CWGINPPS_CWGINPPS1_MASK                            0x2
#define _CWGINPPS_CWGINPPS2_POSN                            0x2
#define _CWGINPPS_CWGINPPS2_POSITION                        0x2
#define _CWGINPPS_CWGINPPS2_SIZE                            0x1
#define _CWGINPPS_CWGINPPS2_LENGTH                          0x1
#define _CWGINPPS_CWGINPPS2_MASK                            0x4
#define _CWGINPPS_CWGINPPS3_POSN                            0x3
#define _CWGINPPS_CWGINPPS3_POSITION                        0x3
#define _CWGINPPS_CWGINPPS3_SIZE                            0x1
#define _CWGINPPS_CWGINPPS3_LENGTH                          0x1
#define _CWGINPPS_CWGINPPS3_MASK                            0x8
#define _CWGINPPS_CWGINPPS4_POSN                            0x4
#define _CWGINPPS_CWGINPPS4_POSITION                        0x4
#define _CWGINPPS_CWGINPPS4_SIZE                            0x1
#define _CWGINPPS_CWGINPPS4_LENGTH                          0x1
#define _CWGINPPS_CWGINPPS4_MASK                            0x10
#define _CWGINPPS_CWG1INPPS_POSN                            0x0
#define _CWGINPPS_CWG1INPPS_POSITION                        0x0
#define _CWGINPPS_CWG1INPPS_SIZE                            0x6
#define _CWGINPPS_CWG1INPPS_LENGTH                          0x6
#define _CWGINPPS_CWG1INPPS_MASK                            0x3F
#define _CWGINPPS_CWG1INPPS0_POSN                           0x0
#define _CWGINPPS_CWG1INPPS0_POSITION                       0x0
#define _CWGINPPS_CWG1INPPS0_SIZE                           0x1
#define _CWGINPPS_CWG1INPPS0_LENGTH                         0x1
#define _CWGINPPS_CWG1INPPS0_MASK                           0x1
#define _CWGINPPS_CWG1INPPS1_POSN                           0x1
#define _CWGINPPS_CWG1INPPS1_POSITION                       0x1
#define _CWGINPPS_CWG1INPPS1_SIZE                           0x1
#define _CWGINPPS_CWG1INPPS1_LENGTH                         0x1
#define _CWGINPPS_CWG1INPPS1_MASK                           0x2
#define _CWGINPPS_CWG1INPPS2_POSN                           0x2
#define _CWGINPPS_CWG1INPPS2_POSITION                       0x2
#define _CWGINPPS_CWG1INPPS2_SIZE                           0x1
#define _CWGINPPS_CWG1INPPS2_LENGTH                         0x1
#define _CWGINPPS_CWG1INPPS2_MASK                           0x4
#define _CWGINPPS_CWG1INPPS3_POSN                           0x3
#define _CWGINPPS_CWG1INPPS3_POSITION                       0x3
#define _CWGINPPS_CWG1INPPS3_SIZE                           0x1
#define _CWGINPPS_CWG1INPPS3_LENGTH                         0x1
#define _CWGINPPS_CWG1INPPS3_MASK                           0x8
#define _CWGINPPS_CWG1INPPS4_POSN                           0x4
#define _CWGINPPS_CWG1INPPS4_POSITION                       0x4
#define _CWGINPPS_CWG1INPPS4_SIZE                           0x1
#define _CWGINPPS_CWG1INPPS4_LENGTH                         0x1
#define _CWGINPPS_CWG1INPPS4_MASK                           0x10

// Register: MDCARLPPS
#define MDCARLPPS MDCARLPPS
extern volatile unsigned char           MDCARLPPS           __at(0xE0C);
#ifndef _LIB_BUILD
asm("MDCARLPPS equ 0E0Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned MDCARLPPS              :6;
    };
    struct {
        unsigned MDCARLPPS0             :1;
        unsigned MDCARLPPS1             :1;
        unsigned MDCARLPPS2             :1;
        unsigned MDCARLPPS3             :1;
        unsigned MDCARLPPS4             :1;
        unsigned MDCARLPPS5             :1;
    };
} MDCARLPPSbits_t;
extern volatile MDCARLPPSbits_t MDCARLPPSbits __at(0xE0C);
// bitfield macros
#define _MDCARLPPS_PIN_POSN                                 0x0
#define _MDCARLPPS_PIN_POSITION                             0x0
#define _MDCARLPPS_PIN_SIZE                                 0x3
#define _MDCARLPPS_PIN_LENGTH                               0x3
#define _MDCARLPPS_PIN_MASK                                 0x7
#define _MDCARLPPS_PORT_POSN                                0x3
#define _MDCARLPPS_PORT_POSITION                            0x3
#define _MDCARLPPS_PORT_SIZE                                0x3
#define _MDCARLPPS_PORT_LENGTH                              0x3
#define _MDCARLPPS_PORT_MASK                                0x38
#define _MDCARLPPS_MDCARLPPS_POSN                           0x0
#define _MDCARLPPS_MDCARLPPS_POSITION                       0x0
#define _MDCARLPPS_MDCARLPPS_SIZE                           0x6
#define _MDCARLPPS_MDCARLPPS_LENGTH                         0x6
#define _MDCARLPPS_MDCARLPPS_MASK                           0x3F
#define _MDCARLPPS_MDCARLPPS0_POSN                          0x0
#define _MDCARLPPS_MDCARLPPS0_POSITION                      0x0
#define _MDCARLPPS_MDCARLPPS0_SIZE                          0x1
#define _MDCARLPPS_MDCARLPPS0_LENGTH                        0x1
#define _MDCARLPPS_MDCARLPPS0_MASK                          0x1
#define _MDCARLPPS_MDCARLPPS1_POSN                          0x1
#define _MDCARLPPS_MDCARLPPS1_POSITION                      0x1
#define _MDCARLPPS_MDCARLPPS1_SIZE                          0x1
#define _MDCARLPPS_MDCARLPPS1_LENGTH                        0x1
#define _MDCARLPPS_MDCARLPPS1_MASK                          0x2
#define _MDCARLPPS_MDCARLPPS2_POSN                          0x2
#define _MDCARLPPS_MDCARLPPS2_POSITION                      0x2
#define _MDCARLPPS_MDCARLPPS2_SIZE                          0x1
#define _MDCARLPPS_MDCARLPPS2_LENGTH                        0x1
#define _MDCARLPPS_MDCARLPPS2_MASK                          0x4
#define _MDCARLPPS_MDCARLPPS3_POSN                          0x3
#define _MDCARLPPS_MDCARLPPS3_POSITION                      0x3
#define _MDCARLPPS_MDCARLPPS3_SIZE                          0x1
#define _MDCARLPPS_MDCARLPPS3_LENGTH                        0x1
#define _MDCARLPPS_MDCARLPPS3_MASK                          0x8
#define _MDCARLPPS_MDCARLPPS4_POSN                          0x4
#define _MDCARLPPS_MDCARLPPS4_POSITION                      0x4
#define _MDCARLPPS_MDCARLPPS4_SIZE                          0x1
#define _MDCARLPPS_MDCARLPPS4_LENGTH                        0x1
#define _MDCARLPPS_MDCARLPPS4_MASK                          0x10
#define _MDCARLPPS_MDCARLPPS5_POSN                          0x5
#define _MDCARLPPS_MDCARLPPS5_POSITION                      0x5
#define _MDCARLPPS_MDCARLPPS5_SIZE                          0x1
#define _MDCARLPPS_MDCARLPPS5_LENGTH                        0x1
#define _MDCARLPPS_MDCARLPPS5_MASK                          0x20

// Register: MDCARHPPS
#define MDCARHPPS MDCARHPPS
extern volatile unsigned char           MDCARHPPS           __at(0xE0D);
#ifndef _LIB_BUILD
asm("MDCARHPPS equ 0E0Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned MDCARHPPS              :6;
    };
    struct {
        unsigned MDCARHPPS0             :1;
        unsigned MDCARHPPS1             :1;
        unsigned MDCARHPPS2             :1;
        unsigned MDCARHPPS3             :1;
        unsigned MDCARHPPS4             :1;
        unsigned MDCARHPPS5             :1;
    };
} MDCARHPPSbits_t;
extern volatile MDCARHPPSbits_t MDCARHPPSbits __at(0xE0D);
// bitfield macros
#define _MDCARHPPS_PIN_POSN                                 0x0
#define _MDCARHPPS_PIN_POSITION                             0x0
#define _MDCARHPPS_PIN_SIZE                                 0x3
#define _MDCARHPPS_PIN_LENGTH                               0x3
#define _MDCARHPPS_PIN_MASK                                 0x7
#define _MDCARHPPS_PORT_POSN                                0x3
#define _MDCARHPPS_PORT_POSITION                            0x3
#define _MDCARHPPS_PORT_SIZE                                0x3
#define _MDCARHPPS_PORT_LENGTH                              0x3
#define _MDCARHPPS_PORT_MASK                                0x38
#define _MDCARHPPS_MDCARHPPS_POSN                           0x0
#define _MDCARHPPS_MDCARHPPS_POSITION                       0x0
#define _MDCARHPPS_MDCARHPPS_SIZE                           0x6
#define _MDCARHPPS_MDCARHPPS_LENGTH                         0x6
#define _MDCARHPPS_MDCARHPPS_MASK                           0x3F
#define _MDCARHPPS_MDCARHPPS0_POSN                          0x0
#define _MDCARHPPS_MDCARHPPS0_POSITION                      0x0
#define _MDCARHPPS_MDCARHPPS0_SIZE                          0x1
#define _MDCARHPPS_MDCARHPPS0_LENGTH                        0x1
#define _MDCARHPPS_MDCARHPPS0_MASK                          0x1
#define _MDCARHPPS_MDCARHPPS1_POSN                          0x1
#define _MDCARHPPS_MDCARHPPS1_POSITION                      0x1
#define _MDCARHPPS_MDCARHPPS1_SIZE                          0x1
#define _MDCARHPPS_MDCARHPPS1_LENGTH                        0x1
#define _MDCARHPPS_MDCARHPPS1_MASK                          0x2
#define _MDCARHPPS_MDCARHPPS2_POSN                          0x2
#define _MDCARHPPS_MDCARHPPS2_POSITION                      0x2
#define _MDCARHPPS_MDCARHPPS2_SIZE                          0x1
#define _MDCARHPPS_MDCARHPPS2_LENGTH                        0x1
#define _MDCARHPPS_MDCARHPPS2_MASK                          0x4
#define _MDCARHPPS_MDCARHPPS3_POSN                          0x3
#define _MDCARHPPS_MDCARHPPS3_POSITION                      0x3
#define _MDCARHPPS_MDCARHPPS3_SIZE                          0x1
#define _MDCARHPPS_MDCARHPPS3_LENGTH                        0x1
#define _MDCARHPPS_MDCARHPPS3_MASK                          0x8
#define _MDCARHPPS_MDCARHPPS4_POSN                          0x4
#define _MDCARHPPS_MDCARHPPS4_POSITION                      0x4
#define _MDCARHPPS_MDCARHPPS4_SIZE                          0x1
#define _MDCARHPPS_MDCARHPPS4_LENGTH                        0x1
#define _MDCARHPPS_MDCARHPPS4_MASK                          0x10
#define _MDCARHPPS_MDCARHPPS5_POSN                          0x5
#define _MDCARHPPS_MDCARHPPS5_POSITION                      0x5
#define _MDCARHPPS_MDCARHPPS5_SIZE                          0x1
#define _MDCARHPPS_MDCARHPPS5_LENGTH                        0x1
#define _MDCARHPPS_MDCARHPPS5_MASK                          0x20

// Register: MDSRCPPS
#define MDSRCPPS MDSRCPPS
extern volatile unsigned char           MDSRCPPS            __at(0xE0E);
#ifndef _LIB_BUILD
asm("MDSRCPPS equ 0E0Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned MDSRCPPS               :6;
    };
    struct {
        unsigned MDSRCPPS0              :1;
        unsigned MDSRCPPS1              :1;
        unsigned MDSRCPPS2              :1;
        unsigned MDSRCPPS3              :1;
        unsigned MDSRCPPS4              :1;
        unsigned MDSRCPPS5              :1;
    };
} MDSRCPPSbits_t;
extern volatile MDSRCPPSbits_t MDSRCPPSbits __at(0xE0E);
// bitfield macros
#define _MDSRCPPS_PIN_POSN                                  0x0
#define _MDSRCPPS_PIN_POSITION                              0x0
#define _MDSRCPPS_PIN_SIZE                                  0x3
#define _MDSRCPPS_PIN_LENGTH                                0x3
#define _MDSRCPPS_PIN_MASK                                  0x7
#define _MDSRCPPS_PORT_POSN                                 0x3
#define _MDSRCPPS_PORT_POSITION                             0x3
#define _MDSRCPPS_PORT_SIZE                                 0x3
#define _MDSRCPPS_PORT_LENGTH                               0x3
#define _MDSRCPPS_PORT_MASK                                 0x38
#define _MDSRCPPS_MDSRCPPS_POSN                             0x0
#define _MDSRCPPS_MDSRCPPS_POSITION                         0x0
#define _MDSRCPPS_MDSRCPPS_SIZE                             0x6
#define _MDSRCPPS_MDSRCPPS_LENGTH                           0x6
#define _MDSRCPPS_MDSRCPPS_MASK                             0x3F
#define _MDSRCPPS_MDSRCPPS0_POSN                            0x0
#define _MDSRCPPS_MDSRCPPS0_POSITION                        0x0
#define _MDSRCPPS_MDSRCPPS0_SIZE                            0x1
#define _MDSRCPPS_MDSRCPPS0_LENGTH                          0x1
#define _MDSRCPPS_MDSRCPPS0_MASK                            0x1
#define _MDSRCPPS_MDSRCPPS1_POSN                            0x1
#define _MDSRCPPS_MDSRCPPS1_POSITION                        0x1
#define _MDSRCPPS_MDSRCPPS1_SIZE                            0x1
#define _MDSRCPPS_MDSRCPPS1_LENGTH                          0x1
#define _MDSRCPPS_MDSRCPPS1_MASK                            0x2
#define _MDSRCPPS_MDSRCPPS2_POSN                            0x2
#define _MDSRCPPS_MDSRCPPS2_POSITION                        0x2
#define _MDSRCPPS_MDSRCPPS2_SIZE                            0x1
#define _MDSRCPPS_MDSRCPPS2_LENGTH                          0x1
#define _MDSRCPPS_MDSRCPPS2_MASK                            0x4
#define _MDSRCPPS_MDSRCPPS3_POSN                            0x3
#define _MDSRCPPS_MDSRCPPS3_POSITION                        0x3
#define _MDSRCPPS_MDSRCPPS3_SIZE                            0x1
#define _MDSRCPPS_MDSRCPPS3_LENGTH                          0x1
#define _MDSRCPPS_MDSRCPPS3_MASK                            0x8
#define _MDSRCPPS_MDSRCPPS4_POSN                            0x4
#define _MDSRCPPS_MDSRCPPS4_POSITION                        0x4
#define _MDSRCPPS_MDSRCPPS4_SIZE                            0x1
#define _MDSRCPPS_MDSRCPPS4_LENGTH                          0x1
#define _MDSRCPPS_MDSRCPPS4_MASK                            0x10
#define _MDSRCPPS_MDSRCPPS5_POSN                            0x5
#define _MDSRCPPS_MDSRCPPS5_POSITION                        0x5
#define _MDSRCPPS_MDSRCPPS5_SIZE                            0x1
#define _MDSRCPPS_MDSRCPPS5_LENGTH                          0x1
#define _MDSRCPPS_MDSRCPPS5_MASK                            0x20

