MikroElektronika/core_packages/PIC/XC8/def/PIC18LF67K40/mcu.h
// Register: PIR7
#define PIR7 PIR7
extern volatile unsigned char           PIR7                __at(0xE3A);
#ifndef _LIB_BUILD
asm("PIR7 equ 0E3Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP1IF                 :1;
        unsigned CCP2IF                 :1;
        unsigned CCP3IF                 :1;
        unsigned CCP4IF                 :1;
        unsigned CCP5IF                 :1;
    };
} PIR7bits_t;
extern volatile PIR7bits_t PIR7bits __at(0xE3A);
// bitfield macros
#define _PIR7_CCP1IF_POSN                                   0x0
#define _PIR7_CCP1IF_POSITION                               0x0
#define _PIR7_CCP1IF_SIZE                                   0x1
#define _PIR7_CCP1IF_LENGTH                                 0x1
#define _PIR7_CCP1IF_MASK                                   0x1
#define _PIR7_CCP2IF_POSN                                   0x1
#define _PIR7_CCP2IF_POSITION                               0x1
#define _PIR7_CCP2IF_SIZE                                   0x1
#define _PIR7_CCP2IF_LENGTH                                 0x1
#define _PIR7_CCP2IF_MASK                                   0x2
#define _PIR7_CCP3IF_POSN                                   0x2
#define _PIR7_CCP3IF_POSITION                               0x2
#define _PIR7_CCP3IF_SIZE                                   0x1
#define _PIR7_CCP3IF_LENGTH                                 0x1
#define _PIR7_CCP3IF_MASK                                   0x4
#define _PIR7_CCP4IF_POSN                                   0x3
#define _PIR7_CCP4IF_POSITION                               0x3
#define _PIR7_CCP4IF_SIZE                                   0x1
#define _PIR7_CCP4IF_LENGTH                                 0x1
#define _PIR7_CCP4IF_MASK                                   0x8
#define _PIR7_CCP5IF_POSN                                   0x4
#define _PIR7_CCP5IF_POSITION                               0x4
#define _PIR7_CCP5IF_SIZE                                   0x1
#define _PIR7_CCP5IF_LENGTH                                 0x1
#define _PIR7_CCP5IF_MASK                                   0x10

// Register: PIR8
#define PIR8 PIR8
extern volatile unsigned char           PIR8                __at(0xE3B);
#ifndef _LIB_BUILD
asm("PIR8 equ 0E3Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CWGIF                  :1;
        unsigned                        :4;
        unsigned NVMIF                  :1;
        unsigned CRCIF                  :1;
        unsigned SCANIF                 :1;
    };
    struct {
        unsigned CWG1IF                 :1;
    };
} PIR8bits_t;
extern volatile PIR8bits_t PIR8bits __at(0xE3B);
// bitfield macros
#define _PIR8_CWGIF_POSN                                    0x0
#define _PIR8_CWGIF_POSITION                                0x0
#define _PIR8_CWGIF_SIZE                                    0x1
#define _PIR8_CWGIF_LENGTH                                  0x1
#define _PIR8_CWGIF_MASK                                    0x1
#define _PIR8_NVMIF_POSN                                    0x5
#define _PIR8_NVMIF_POSITION                                0x5
#define _PIR8_NVMIF_SIZE                                    0x1
#define _PIR8_NVMIF_LENGTH                                  0x1
#define _PIR8_NVMIF_MASK                                    0x20
#define _PIR8_CRCIF_POSN                                    0x6
#define _PIR8_CRCIF_POSITION                                0x6
#define _PIR8_CRCIF_SIZE                                    0x1
#define _PIR8_CRCIF_LENGTH                                  0x1
#define _PIR8_CRCIF_MASK                                    0x40
#define _PIR8_SCANIF_POSN                                   0x7
#define _PIR8_SCANIF_POSITION                               0x7
#define _PIR8_SCANIF_SIZE                                   0x1
#define _PIR8_SCANIF_LENGTH                                 0x1
#define _PIR8_SCANIF_MASK                                   0x80
#define _PIR8_CWG1IF_POSN                                   0x0
#define _PIR8_CWG1IF_POSITION                               0x0
#define _PIR8_CWG1IF_SIZE                                   0x1
#define _PIR8_CWG1IF_LENGTH                                 0x1
#define _PIR8_CWG1IF_MASK                                   0x1

// Register: PIR9
#define PIR9 PIR9
extern volatile unsigned char           PIR9                __at(0xE3C);
#ifndef _LIB_BUILD
asm("PIR9 equ 0E3Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SMT1IF                 :1;
        unsigned SMT1PRAIF              :1;
        unsigned SMT1PWAIF              :1;
        unsigned SMT2IF                 :1;
        unsigned SMT2PRAIF              :1;
        unsigned SMT2PWAIF              :1;
    };
} PIR9bits_t;
extern volatile PIR9bits_t PIR9bits __at(0xE3C);
// bitfield macros
#define _PIR9_SMT1IF_POSN                                   0x0
#define _PIR9_SMT1IF_POSITION                               0x0
#define _PIR9_SMT1IF_SIZE                                   0x1
#define _PIR9_SMT1IF_LENGTH                                 0x1
#define _PIR9_SMT1IF_MASK                                   0x1
#define _PIR9_SMT1PRAIF_POSN                                0x1
#define _PIR9_SMT1PRAIF_POSITION                            0x1
#define _PIR9_SMT1PRAIF_SIZE                                0x1
#define _PIR9_SMT1PRAIF_LENGTH                              0x1
#define _PIR9_SMT1PRAIF_MASK                                0x2
#define _PIR9_SMT1PWAIF_POSN                                0x2
#define _PIR9_SMT1PWAIF_POSITION                            0x2
#define _PIR9_SMT1PWAIF_SIZE                                0x1
#define _PIR9_SMT1PWAIF_LENGTH                              0x1
#define _PIR9_SMT1PWAIF_MASK                                0x4
#define _PIR9_SMT2IF_POSN                                   0x3
#define _PIR9_SMT2IF_POSITION                               0x3
#define _PIR9_SMT2IF_SIZE                                   0x1
#define _PIR9_SMT2IF_LENGTH                                 0x1
#define _PIR9_SMT2IF_MASK                                   0x8
#define _PIR9_SMT2PRAIF_POSN                                0x4
#define _PIR9_SMT2PRAIF_POSITION                            0x4
#define _PIR9_SMT2PRAIF_SIZE                                0x1
#define _PIR9_SMT2PRAIF_LENGTH                              0x1
#define _PIR9_SMT2PRAIF_MASK                                0x10
#define _PIR9_SMT2PWAIF_POSN                                0x5
#define _PIR9_SMT2PWAIF_POSITION                            0x5
#define _PIR9_SMT2PWAIF_SIZE                                0x1
#define _PIR9_SMT2PWAIF_LENGTH                              0x1
#define _PIR9_SMT2PWAIF_MASK                                0x20

// Register: WDTCON0
#define WDTCON0 WDTCON0
extern volatile unsigned char           WDTCON0             __at(0xE3D);
#ifndef _LIB_BUILD
asm("WDTCON0 equ 0E3Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEN                    :1;
        unsigned WDTPS                  :5;
    };
    struct {
        unsigned SWDTEN                 :1;
    };
    struct {
        unsigned WDTSEN                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned WDTPS0                 :1;
        unsigned WDTPS1                 :1;
        unsigned WDTPS2                 :1;
        unsigned WDTPS3                 :1;
        unsigned WDTPS4                 :1;
    };
} WDTCON0bits_t;
