MikroElektronika/core_packages/PIC/XC8/def/PIC18LF67K40/mcu.h
extern volatile SSP2CON3bits_t SSP2CON3bits __at(0xEDB);
// bitfield macros
#define _SSP2CON3_DHEN_POSN                                 0x0
#define _SSP2CON3_DHEN_POSITION                             0x0
#define _SSP2CON3_DHEN_SIZE                                 0x1
#define _SSP2CON3_DHEN_LENGTH                               0x1
#define _SSP2CON3_DHEN_MASK                                 0x1
#define _SSP2CON3_AHEN_POSN                                 0x1
#define _SSP2CON3_AHEN_POSITION                             0x1
#define _SSP2CON3_AHEN_SIZE                                 0x1
#define _SSP2CON3_AHEN_LENGTH                               0x1
#define _SSP2CON3_AHEN_MASK                                 0x2
#define _SSP2CON3_SBCDE_POSN                                0x2
#define _SSP2CON3_SBCDE_POSITION                            0x2
#define _SSP2CON3_SBCDE_SIZE                                0x1
#define _SSP2CON3_SBCDE_LENGTH                              0x1
#define _SSP2CON3_SBCDE_MASK                                0x4
#define _SSP2CON3_SDAHT_POSN                                0x3
#define _SSP2CON3_SDAHT_POSITION                            0x3
#define _SSP2CON3_SDAHT_SIZE                                0x1
#define _SSP2CON3_SDAHT_LENGTH                              0x1
#define _SSP2CON3_SDAHT_MASK                                0x8
#define _SSP2CON3_BOEN_POSN                                 0x4
#define _SSP2CON3_BOEN_POSITION                             0x4
#define _SSP2CON3_BOEN_SIZE                                 0x1
#define _SSP2CON3_BOEN_LENGTH                               0x1
#define _SSP2CON3_BOEN_MASK                                 0x10
#define _SSP2CON3_SCIE_POSN                                 0x5
#define _SSP2CON3_SCIE_POSITION                             0x5
#define _SSP2CON3_SCIE_SIZE                                 0x1
#define _SSP2CON3_SCIE_LENGTH                               0x1
#define _SSP2CON3_SCIE_MASK                                 0x20
#define _SSP2CON3_PCIE_POSN                                 0x6
#define _SSP2CON3_PCIE_POSITION                             0x6
#define _SSP2CON3_PCIE_SIZE                                 0x1
#define _SSP2CON3_PCIE_LENGTH                               0x1
#define _SSP2CON3_PCIE_MASK                                 0x40
#define _SSP2CON3_ACKTIM_POSN                               0x7
#define _SSP2CON3_ACKTIM_POSITION                           0x7
#define _SSP2CON3_ACKTIM_SIZE                               0x1
#define _SSP2CON3_ACKTIM_LENGTH                             0x1
#define _SSP2CON3_ACKTIM_MASK                               0x80

// Register: RC5REG
#define RC5REG RC5REG
extern volatile unsigned char           RC5REG              __at(0xEDC);
#ifndef _LIB_BUILD
asm("RC5REG equ 0EDCh");
#endif
// aliases
extern volatile unsigned char           RCREG5              __at(0xEDC);
#ifndef _LIB_BUILD
asm("RCREG5 equ 0EDCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC5REG                 :8;
    };
} RC5REGbits_t;
extern volatile RC5REGbits_t RC5REGbits __at(0xEDC);
// bitfield macros
#define _RC5REG_RC5REG_POSN                                 0x0
#define _RC5REG_RC5REG_POSITION                             0x0
#define _RC5REG_RC5REG_SIZE                                 0x8
#define _RC5REG_RC5REG_LENGTH                               0x8
#define _RC5REG_RC5REG_MASK                                 0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned RC5REG                 :8;
    };
} RCREG5bits_t;
extern volatile RCREG5bits_t RCREG5bits __at(0xEDC);
// bitfield macros
#define _RCREG5_RC5REG_POSN                                 0x0
#define _RCREG5_RC5REG_POSITION                             0x0
#define _RCREG5_RC5REG_SIZE                                 0x8
#define _RCREG5_RC5REG_LENGTH                               0x8
#define _RCREG5_RC5REG_MASK                                 0xFF

// Register: TX5REG
#define TX5REG TX5REG
extern volatile unsigned char           TX5REG              __at(0xEDD);
#ifndef _LIB_BUILD
asm("TX5REG equ 0EDDh");
#endif
// aliases
extern volatile unsigned char           TXREG5              __at(0xEDD);
#ifndef _LIB_BUILD
asm("TXREG5 equ 0EDDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TX5REG                 :8;
    };
} TX5REGbits_t;
extern volatile TX5REGbits_t TX5REGbits __at(0xEDD);
// bitfield macros
#define _TX5REG_TX5REG_POSN                                 0x0
#define _TX5REG_TX5REG_POSITION                             0x0
#define _TX5REG_TX5REG_SIZE                                 0x8
#define _TX5REG_TX5REG_LENGTH                               0x8
#define _TX5REG_TX5REG_MASK                                 0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned TX5REG                 :8;
    };
} TXREG5bits_t;
extern volatile TXREG5bits_t TXREG5bits __at(0xEDD);
// bitfield macros
#define _TXREG5_TX5REG_POSN                                 0x0
#define _TXREG5_TX5REG_POSITION                             0x0
#define _TXREG5_TX5REG_SIZE                                 0x8
#define _TXREG5_TX5REG_LENGTH                               0x8
#define _TXREG5_TX5REG_MASK                                 0xFF

// Register: SP5BRG
#define SP5BRG SP5BRG
extern volatile unsigned short          SP5BRG              __at(0xEDE);
#ifndef _LIB_BUILD
asm("SP5BRG equ 0EDEh");
#endif

// Register: SP5BRGL
#define SP5BRGL SP5BRGL
extern volatile unsigned char           SP5BRGL             __at(0xEDE);
#ifndef _LIB_BUILD
asm("SP5BRGL equ 0EDEh");
#endif
// aliases
extern volatile unsigned char           SPBRG5              __at(0xEDE);
#ifndef _LIB_BUILD
asm("SPBRG5 equ 0EDEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SP5BRGL                :8;
    };
} SP5BRGLbits_t;
extern volatile SP5BRGLbits_t SP5BRGLbits __at(0xEDE);
// bitfield macros
#define _SP5BRGL_SP5BRGL_POSN                               0x0
#define _SP5BRGL_SP5BRGL_POSITION                           0x0
#define _SP5BRGL_SP5BRGL_SIZE                               0x8
#define _SP5BRGL_SP5BRGL_LENGTH                             0x8
#define _SP5BRGL_SP5BRGL_MASK                               0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned SP5BRGL                :8;
    };
} SPBRG5bits_t;
