MikroElektronika/core_packages/PIC/XC8/def/PIC18LF67K40/mcu.h
// Register: NVMADRH
#define NVMADRH NVMADRH
extern volatile unsigned char           NVMADRH             __at(0xF75);
#ifndef _LIB_BUILD
asm("NVMADRH equ 0F75h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADR                    :2;
    };
    struct {
        unsigned NVMADR8                :1;
        unsigned NVMADR9                :1;
    };
    struct {
        unsigned ADR8                   :1;
        unsigned ADR9                   :1;
    };
    struct {
        unsigned ADRH                   :2;
    };
} NVMADRHbits_t;
extern volatile NVMADRHbits_t NVMADRHbits __at(0xF75);
// bitfield macros
#define _NVMADRH_ADR_POSN                                   0x0
#define _NVMADRH_ADR_POSITION                               0x0
#define _NVMADRH_ADR_SIZE                                   0x2
#define _NVMADRH_ADR_LENGTH                                 0x2
#define _NVMADRH_ADR_MASK                                   0x3
#define _NVMADRH_NVMADR8_POSN                               0x0
#define _NVMADRH_NVMADR8_POSITION                           0x0
#define _NVMADRH_NVMADR8_SIZE                               0x1
#define _NVMADRH_NVMADR8_LENGTH                             0x1
#define _NVMADRH_NVMADR8_MASK                               0x1
#define _NVMADRH_NVMADR9_POSN                               0x1
#define _NVMADRH_NVMADR9_POSITION                           0x1
#define _NVMADRH_NVMADR9_SIZE                               0x1
#define _NVMADRH_NVMADR9_LENGTH                             0x1
#define _NVMADRH_NVMADR9_MASK                               0x2
#define _NVMADRH_ADR8_POSN                                  0x0
#define _NVMADRH_ADR8_POSITION                              0x0
#define _NVMADRH_ADR8_SIZE                                  0x1
#define _NVMADRH_ADR8_LENGTH                                0x1
#define _NVMADRH_ADR8_MASK                                  0x1
#define _NVMADRH_ADR9_POSN                                  0x1
#define _NVMADRH_ADR9_POSITION                              0x1
#define _NVMADRH_ADR9_SIZE                                  0x1
#define _NVMADRH_ADR9_LENGTH                                0x1
#define _NVMADRH_ADR9_MASK                                  0x2
#define _NVMADRH_ADRH_POSN                                  0x0
#define _NVMADRH_ADRH_POSITION                              0x0
#define _NVMADRH_ADRH_SIZE                                  0x2
#define _NVMADRH_ADRH_LENGTH                                0x2
#define _NVMADRH_ADRH_MASK                                  0x3

// Register: NVMDAT
#define NVMDAT NVMDAT
extern volatile unsigned char           NVMDAT              __at(0xF76);
#ifndef _LIB_BUILD
asm("NVMDAT equ 0F76h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMDAT                 :8;
    };
    struct {
        unsigned NVMDAT0                :1;
        unsigned NVMDAT1                :1;
        unsigned NVMDAT2                :1;
        unsigned NVMDAT3                :1;
        unsigned NVMDAT4                :1;
        unsigned NVMDAT5                :1;
        unsigned NVMDAT6                :1;
        unsigned NVMDAT7                :1;
    };
} NVMDATbits_t;
extern volatile NVMDATbits_t NVMDATbits __at(0xF76);
// bitfield macros
#define _NVMDAT_NVMDAT_POSN                                 0x0
#define _NVMDAT_NVMDAT_POSITION                             0x0
#define _NVMDAT_NVMDAT_SIZE                                 0x8
#define _NVMDAT_NVMDAT_LENGTH                               0x8
#define _NVMDAT_NVMDAT_MASK                                 0xFF
#define _NVMDAT_NVMDAT0_POSN                                0x0
#define _NVMDAT_NVMDAT0_POSITION                            0x0
#define _NVMDAT_NVMDAT0_SIZE                                0x1
#define _NVMDAT_NVMDAT0_LENGTH                              0x1
#define _NVMDAT_NVMDAT0_MASK                                0x1
#define _NVMDAT_NVMDAT1_POSN                                0x1
#define _NVMDAT_NVMDAT1_POSITION                            0x1
#define _NVMDAT_NVMDAT1_SIZE                                0x1
#define _NVMDAT_NVMDAT1_LENGTH                              0x1
#define _NVMDAT_NVMDAT1_MASK                                0x2
#define _NVMDAT_NVMDAT2_POSN                                0x2
#define _NVMDAT_NVMDAT2_POSITION                            0x2
#define _NVMDAT_NVMDAT2_SIZE                                0x1
#define _NVMDAT_NVMDAT2_LENGTH                              0x1
#define _NVMDAT_NVMDAT2_MASK                                0x4
#define _NVMDAT_NVMDAT3_POSN                                0x3
#define _NVMDAT_NVMDAT3_POSITION                            0x3
#define _NVMDAT_NVMDAT3_SIZE                                0x1
#define _NVMDAT_NVMDAT3_LENGTH                              0x1
#define _NVMDAT_NVMDAT3_MASK                                0x8
#define _NVMDAT_NVMDAT4_POSN                                0x4
#define _NVMDAT_NVMDAT4_POSITION                            0x4
#define _NVMDAT_NVMDAT4_SIZE                                0x1
#define _NVMDAT_NVMDAT4_LENGTH                              0x1
#define _NVMDAT_NVMDAT4_MASK                                0x10
#define _NVMDAT_NVMDAT5_POSN                                0x5
#define _NVMDAT_NVMDAT5_POSITION                            0x5
#define _NVMDAT_NVMDAT5_SIZE                                0x1
#define _NVMDAT_NVMDAT5_LENGTH                              0x1
#define _NVMDAT_NVMDAT5_MASK                                0x20
#define _NVMDAT_NVMDAT6_POSN                                0x6
#define _NVMDAT_NVMDAT6_POSITION                            0x6
#define _NVMDAT_NVMDAT6_SIZE                                0x1
#define _NVMDAT_NVMDAT6_LENGTH                              0x1
#define _NVMDAT_NVMDAT6_MASK                                0x40
#define _NVMDAT_NVMDAT7_POSN                                0x7
#define _NVMDAT_NVMDAT7_POSITION                            0x7
#define _NVMDAT_NVMDAT7_SIZE                                0x1
#define _NVMDAT_NVMDAT7_LENGTH                              0x1
#define _NVMDAT_NVMDAT7_MASK                                0x80

// Register: NVMCON1
#define NVMCON1 NVMCON1
extern volatile unsigned char           NVMCON1             __at(0xF77);
#ifndef _LIB_BUILD
asm("NVMCON1 equ 0F77h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD                     :1;
        unsigned WR                     :1;
        unsigned WREN                   :1;
        unsigned WRERR                  :1;
        unsigned FREE                   :1;
        unsigned                        :1;
        unsigned NVMREG                 :2;
    };
    struct {
        unsigned                        :6;
        unsigned NVMREG0                :1;
        unsigned NVMREG1                :1;
    };
} NVMCON1bits_t;
extern volatile NVMCON1bits_t NVMCON1bits __at(0xF77);
// bitfield macros
#define _NVMCON1_RD_POSN                                    0x0
#define _NVMCON1_RD_POSITION                                0x0
#define _NVMCON1_RD_SIZE                                    0x1
#define _NVMCON1_RD_LENGTH                                  0x1
#define _NVMCON1_RD_MASK                                    0x1
#define _NVMCON1_WR_POSN                                    0x1
#define _NVMCON1_WR_POSITION                                0x1
#define _NVMCON1_WR_SIZE                                    0x1
#define _NVMCON1_WR_LENGTH                                  0x1
#define _NVMCON1_WR_MASK                                    0x2
#define _NVMCON1_WREN_POSN                                  0x2
#define _NVMCON1_WREN_POSITION                              0x2
#define _NVMCON1_WREN_SIZE                                  0x1
#define _NVMCON1_WREN_LENGTH                                0x1
#define _NVMCON1_WREN_MASK                                  0x4
#define _NVMCON1_WRERR_POSN                                 0x3
#define _NVMCON1_WRERR_POSITION                             0x3
#define _NVMCON1_WRERR_SIZE                                 0x1
#define _NVMCON1_WRERR_LENGTH                               0x1
#define _NVMCON1_WRERR_MASK                                 0x8
#define _NVMCON1_FREE_POSN                                  0x4
#define _NVMCON1_FREE_POSITION                              0x4
#define _NVMCON1_FREE_SIZE                                  0x1
#define _NVMCON1_FREE_LENGTH                                0x1
#define _NVMCON1_FREE_MASK                                  0x10
#define _NVMCON1_NVMREG_POSN                                0x6
#define _NVMCON1_NVMREG_POSITION                            0x6
#define _NVMCON1_NVMREG_SIZE                                0x2
#define _NVMCON1_NVMREG_LENGTH                              0x2
#define _NVMCON1_NVMREG_MASK                                0xC0
#define _NVMCON1_NVMREG0_POSN                               0x6
#define _NVMCON1_NVMREG0_POSITION                           0x6
#define _NVMCON1_NVMREG0_SIZE                               0x1
#define _NVMCON1_NVMREG0_LENGTH                             0x1
#define _NVMCON1_NVMREG0_MASK                               0x40
#define _NVMCON1_NVMREG1_POSN                               0x7
#define _NVMCON1_NVMREG1_POSITION                           0x7
#define _NVMCON1_NVMREG1_SIZE                               0x1
#define _NVMCON1_NVMREG1_LENGTH                             0x1
#define _NVMCON1_NVMREG1_MASK                               0x80

// Register: NVMCON2
#define NVMCON2 NVMCON2
extern volatile unsigned char           NVMCON2             __at(0xF78);
#ifndef _LIB_BUILD
asm("NVMCON2 equ 0F78h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMCON2                :8;
    };
} NVMCON2bits_t;
extern volatile NVMCON2bits_t NVMCON2bits __at(0xF78);
// bitfield macros
#define _NVMCON2_NVMCON2_POSN                               0x0
#define _NVMCON2_NVMCON2_POSITION                           0x0
#define _NVMCON2_NVMCON2_SIZE                               0x8
#define _NVMCON2_NVMCON2_LENGTH                             0x8
#define _NVMCON2_NVMCON2_MASK                               0xFF

